&НаКлиенте
Процедура ВычислитьРезультат(Команда)
	
	ОсновнойОбмен = 0;
	
	Если Пол = ПредопределенноеЗначение("Перечисление.Пол.Мужской") Тогда
		
		ОсновнойОбмен = ((10 * МассаТела) + (6.25 * ВысотаТела) - (5 * Возраст) + 5) / 86400;
		
	Иначе
		
		ОсновнойОбмен = ((10 * МассаТела) + (6.25 * ВысотаТела) - (5 * Возраст) - 161) / 86400;
		
	КонецЕсли;
	
	ПолучитьДанныеОМаршруте(Маршрут);
	
	ДистанцияМили = Дистанция * 0.000621371;
	НаборВысотыФуты = НаборВысоты * 0.0328084;
	МассаТелаФунты = МассаТела * 2.20462;
	МассаРюкзакаФунты = МассаРюкзака * 2.20462;
	
	СреднийУклон = НаборВысотыФуты / (5280 * ДистанцияМили);
	
	Работа = (280.5 * Pow(СреднийУклон, 5) - 58.7 * Pow(СреднийУклон, 4) - 76.8 * Pow(СреднийУклон, 3) + 51.9 * Pow(СреднийУклон, 2) + 19.6 * СреднийУклон + 2.5) / 2.5;
	
	ЭквивДист = Работа * ДистанцияМили;
	
	КалорииПредв = (ЭквивДист / 12) * (МассаТелаФунты / 190) * 1350;
	Калории = ОсновнойОбмен * ВремяВПути + КалорииПредв * (1 + 2/3 * ((МассаТелаФунты + МассаРюкзакаФунты) / МассаТелаФунты - 1));
	
	Вода = Калории * 0.002;

КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеОМаршруте(МаршрутСсылка)
	
	МаршрутОбъект = МаршрутСсылка.ПолучитьОбъект();
	Дистанция = Число(Лев(МаршрутОбъект.Дистанция, СтрДлина(МаршрутОбъект.Дистанция) - 2));
	НаборВысоты = Число(Лев(МаршрутОбъект.НаборВысоты, СтрДлина(МаршрутОбъект.НаборВысоты) - 2));
	ВремяВПути = МаршрутОбъект.ВремяВПутиСек;
	
КонецПроцедуры
