&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьКарту();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКарту()
	
	Значение = РеквизитФормыВЗначение("Объект");
	ПолеHTML = ПолучитьСтрокуИзДвоичныхДанных(Значение.ПолучитьМакет("ШаблонКартыHTML"));
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеИзJSON(JSON)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSON);
	
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Метки = СтрЗаменить(Объект.МеткиJSON, Символы.ПС, "");
	Метки = СтрЗаменить(Метки, Символы.ВК, "");
	
	ПолеHTML = СтрЗаменить(ПолеHTML, "***", """" + Метки + """");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВGoogleКарты(Команда)
	
	Метки = ПолучитьЗначениеИзJSON(Объект.МеткиJSON);
	
	КоличествоМеток = Метки.Количество();
	
	Ссылка = "https://www.google.com/maps/dir/?api=1&travelmode=walking";
	Ссылка = Ссылка + "&origin=" + СтрЗаменить(Строка(Метки[0][1]), ",", ".") + ", " + СтрЗаменить(Строка(Метки[0][0]), ",", ".");
	Ссылка = Ссылка + "&waypoints=";
	
	Для Индекс = 1 по (КоличествоМеток - 2) Цикл
		
		Ссылка = Ссылка + СтрЗаменить(Строка(Метки[Индекс][1]), ",", ".") + ", " + СтрЗаменить(Строка(Метки[Индекс][0]), ",", ".") + "|";
		
	КонецЦикла;
	
	Ссылка = Лев(Ссылка, СтрДлина(Ссылка) - 1);
	
	Ссылка = Ссылка + "&destination=" + СтрЗаменить(Строка(Метки[КоличествоМеток - 1][1]), ",", ".") + "," + СтрЗаменить(Строка(Метки[КоличествоМеток - 1][0]), ",", ".");
	
	ЗапуститьПриложение(Ссылка);
	
КонецПроцедуры